{
  "name": "Dan Siwiec",
  "title": "Sr. Delivery Principal",
  "practice": "Technology Enablement",
  "subpractice": "Software & Machine Learning Engineering",
  "skills": [
    "Machine Learning Engineering / MLOps",
    "DevOps & CI/CD best practices",
    "Microservices / Event Driven Architecture",
    "Java / JavaScript / Python",
    "AWS / GCP / Kubernetes",
    "SQL / NoSQL"
  ],
  "about": "Dan is a Sr. Delivery Principal for Technology Enablement in the San Francisco office with over 15 years of professional experience. His areas of expertise include Machine Learning Engineering, modern stack cloud native application design and development, CI/CD and software engineering best practices.\n\nDan has led many agile teams, designing and implementing large-scale full-stack enterprise systems involving complex integrations and driving implementation of modern software practices.",
  "certs": [
    "AWS Machine Learning Specialty"
  ],
  "edu": [
    "M.Sc. & B.Sc. Computer Engineering"
  ],
  "projects": [
    {
      "field": "Global Biopharma Corporation",
      "project": "ML Ops Maturity Assessment",
      "role": "Tech Advisor",
      "items": [
        "Led an assessment of Machine Learning Operations maturity within a science and research group performing complex modelling and drug discovery tasks",
        "Assessed the fit of modern ML platforms such as Kubeflow, MLflow and AWS SageMaker",
        "Designed and advised on a roadmap of implementing a standard, efficient ML workflow"
      ]
    },
    {
      "field": "International Airport in California",
      "project": "Event-Driven ML Predictions",
      "role": "Lead Architect",
      "items": [
        "Architected an Event-Driven system based on Apache Kafka composed of ~20 microservices, enabling real-time decision-making supporting airport’s operational capabilities",
        "Led a team of 15 backend, frontend, mobile and DevOps engineers and Data Scientists to develop the system",
        "Advised on the design and implementation of a Machine Learning pipeline",
        "Implemented many critical parts of the system"
      ]
    },
    {
      "field": "Global Bank, UK",
      "project": "Incident Remediation",
      "role": "Principal SME​",
      "items": [
        "Part of a focused specialist team deployed in response to an urgent Severity 1 production incident in client’s payment processing gateway",
        "Responsible for investigation and identifying the cause of the incident",
        "Prepared a holistic assessment of client’s software delivery process",
        "Producing a thorough report for the bank’s CTO"
      ]
    }
  ]
}